[
    {
        "title": "Javascripting your way to electronicless passive wifi devices",
        "description": "One of the things that i love about IOT is its ability to integrate into everything and anything in the world around us. This talk takes IOT to a whole a new level demonstrating how its possible to 3d print IOT devices that need no batteries or electronics to create a passive wifi signal when activated by things around us. These no powered wifi devices have the ability to create a passive wifi signal enabling edge based passive detection which can trigger pre-programmed responses.\nIn this talk we will be looking at the magic behind how the passive wifi sensors work and how they can be utilised from natural disaster monitoring to even the detection of a real world interaction like moving a switch to turning a dial and more.",
        "name": "Steven Cooper",
        "twitter": "DeveloperSteve",
        "website": "",
        "headshot": "developersteve.jpg",
        "type": "talk",
        "length": 30,
        "bio": "",
        "featured": true
    },
    {
        "title": "Automating the $h1T out of everything because I am very very tired",
        "description": "As a full-time student, full-time professional, and unqualified adult, I don't have enough time to do the little things. So I use JS and a couple other languages to automate things like watering my plants, to collect and scrape data for research, to do the boring reports I have to do, and much much more.\nI haven't always succeeded. A couple of failed projects (that I'm planning to take another stab at as soon as I get better) include automating talking to my friends on iMessage, logging my hours automatically at work by tracking when my phone connects to the WiFi, and LED strip lights that sync up to music (it was a hardware issue because it caught fire and I had to throw it out the window D': )\nThe main point of my talk will be that there are many aspects of your life that can be easily automated cheaply and quickly using JS, which will give you back time to spend on the people and the things that you love.",
        "name": "Calvin Dass",
        "twitter": "",
        "website": "calvindass.com",
        "headshot": "calvindass.jpg",
        "type": "talk",
        "length": 20,
        "bio": "",
        "featured": true
    },
    {
        "title": "Making gaming more efficient and fun",
        "description": "Most of us spend a lot of time doing menial tasks like collecting resources, building things while we're gaming, and it takes precious time away from tilting other people. Well, we are going to tilt some people today.",
        "name": "Cong Nguyen",
        "twitter": "devxcong",
        "website": "",
        "headshot": "devxcong.jpg",
        "type": "talk",
        "length": 20,
        "bio": "",
        "featured": true
    },
    {
        "title": "Strike a pose - Gesture recognition in JavaScript with Machine Learning & Arduino",
        "description": "Most of our interactions with technology aren’t really intuitive. We’ve had to adapt to it by learning to type, swipe, execute specific voice commands, etc… but what if we could train technology to adapt to us?\nProgramming for hardware in JavaScript has already been made accessible with frameworks like Johnny-five, but, combining it with machine learning, we have the opportunity to create new and smarter interactions.\nIn this presentation, I will talk about how to build a simple gesture recognition system using JavaScript, Arduino and Machine learning.",
        "name": "Charlie Gerard",
        "twitter": "devdevcharlie",
        "website": "",
        "headshot": "devdevcharlie.jpg",
        "type": "talk",
        "length": 30,
        "bio": "",
        "featured": true
    },
    {
        "title": "Synth and Sequencing for beginners",
        "description": "I bring along a variety of hardware synthesizers, samplers and basic sequencers.\nI teach the basics of sound synthesis, the basics of manipulating sampled audio and how to use a 16 beat step sequencer.\nThis is taught in the context of recreating well known electronic songs.\nThe class makes some samples and we collaboratively build a track together.",
        "name": "Julian Scharf",
        "twitter": "",
        "website": "https://www.linkedin.com/in/jrjscharf/",
        "headshot": "julian.jpg",
        "type": "workshop",
        "length": 60,
        "bio": "",
        "featured": false
    },
    {
        "title": "React Patterns And Refactoring",
        "description": "If you want to make your React better and improve your code base - this is a workshop for you.\nDuring the workshop, we will go through a simple working React project, find some defects and shortcomings and fix them.\nWe will also talk about the best development practices and patterns that you can apply to your project right now.",
        "name": "Inga Pflaumer",
        "twitter": "IngaPflaumer",
        "website": "",
        "headshot": "ingapflaumer.jpg",
        "type": "workshop",
        "length": 150,
        "bio": "",
        "featured": true
    },
    {
        "title": "Refactoring React With Juniors",
        "description": "Building a refactoring culture is not easy, so the sooner you start, the better the results will be. But what if you are leading a team of junior React developers that are not comfortable enough with JS or React yet? What are the steps to ease them and you into refactoring React applications?\nIn this talk I will show how you can teach your juniors to refactor React having readability as your main priority and learning as your second one. The examples are taken from BITVA - a non-commercial study project for female junior developers built with Electron, Node.js and React.\nThe talk will show:\n* what are the best practices working with junior React teams\n* what to watch out for when you refactor React with juniors\n* how to build a junior friendly culture.\nThis talk was inspired by a big refactoring task completed by the team of junior female developers that I mentor. I had a chance to see what are the difficulties in React and refactoring that throw juniors off, what scares them and what helps them to overcome their insecurities. I think my experience will be helpful for anyone who wants to work with junior developers in React while having a clean, readable and junior friendly code base.",
        "name": "Inga Pflaumer",
        "twitter": "IngaPflaumer",
        "website": "",
        "headshot": "ingapflaumer.jpg",
        "type": "talk",
        "length": 20,
        "bio": "",
        "featured": false
    },
    {
        "title": "Demystifying and accepting payments online",
        "description": "Me: Have you ever wondered what happens when you pay with your credit card? Where does your money go? Or who gets paid? Why are there fees? How are your details securely handled? \nMost sane people: Nope.\nMe: Great! Let’s get started.\nIn this workshop we will quickly go over how card payments work, why they exist, and important for most, how fees work. We’ll then get technical and discuss how to accept payments online, how to keep payment details safe, and how to determine which types of payment flows makes the most sense for your fledgling business.",
        "name": "Daniel Miller",
        "twitter": "dalanmiller",
        "website": "",
        "headshot": "dalanmiller.png",
        "type": "workshop",
        "length": 90,
        "bio": "",
        "featured": true
    },
    {
        "title": "Opening Doors with JSON Web Tokens",
        "description": "Let's connect our front door to the internet! What could possibly go wrong? Securing IoT is hard, and the last thing we want to do is let some stranger in!\nLet's take a step back and consider other ways of securing that door, and granting access remotely. How can we do this without connecting your door to the internet, and while adhering to common protocols and data formats throughout?\nIn this talk, you will learn:\n* how JSON Web Tokens can be used to transmit credentials to an air-gapped device;\n* how this process can still allow someone to grant remote access;\n* how to apply this theory to other IoT devices; and\n* how this theory can help even in IoT devices that need direct internet access.\nThe talk includes a live demo, featuring an actual door.",
        "name": "Ben Dechrai",
        "twitter": "bendechrai",
        "website": "",
        "headshot": "bendechrai.png",
        "type": "talk",
        "length": 30,
        "bio": "",
        "featured": true
    },
    {
        "title": "The nerurodiversity factor in tech",
        "description": "Some jobs will screen out 'neruodiversity', but tech seems to actively recruit! Depression, mania, anxiety and other disorders are very well represented in our community, current speaker included.\nJulian will discuss navigating a tech career with a potentially limiting but ultimately awesome mental 'feature'. \nHe will discuss (with autobiographical examples):\n* having an 'episode' in the workplace,\n* what if feels like from the inside\n* how to help a colleague",
        "name": "Julian Scharf",
        "twitter": "",
        "website": "https://www.linkedin.com/in/jrjscharf/",
        "headshot": "julian.jpg",
        "type": "talk",
        "length": 30,
        "bio": "",
        "featured": true
    },
    {
        "title": "Fewer Bugs with Better TypeScript Types",
        "description": "A quick tour through some ways we can make our types work harder for us, to prevent unwanted nasties creeping in. We'll cover 'shrinking' our types to better fit our problems, how to avoid repeating yourself, and some TypeScript quirks to avoid.\n(This talk is aimed at those with some familiarity with JS and TypeScript, but I deliberately include ramp-ups to make sure complete TypeScript newbies get something out of it.)",
        "name": "Rob Howard",
        "twitter": "damncabbage",
        "website": "",
        "headshot": "damncabbage.jpg",
        "type": "talk",
        "length": 30,
        "bio": "",
        "featured": true
    },
    {
        "title": "Tech communities",
        "description": "I bet all of us have at least one friend/acquaintance from developers world who don't understand why we need tech communities, what's the point to go on meetups, why companies sponsor such meetups, why women tech communities exist and so on. Most of the time discussion on this topic takes us to the dead end. I would like to extend this topic and point out different aspects of the tech communities that are so crucial for our modern and future tech world. Being a leader of one of the biggest women tech communities in Australia, a member, co-organizer, mentor and supporter at so many other tech communities during the last 4 years I built some deeper understanding of this question and hope will be able to give you some strong points to support you in your future discussions on this subject.",
        "name": "Tanya Butenko",
        "twitter": "ButenkoMe",
        "website": "",
        "headshot": "butenkome.jpg",
        "type": "talk",
        "length": 30,
        "bio": "",
        "featured": true
    }
]
